loadtest.yml
config:
  target: "http://flashmart-alb-1234567890.ap-south-1.elb.amazonaws.com" # REPLACE WITH YOUR ALB URL AFTER DEPLOYMENT
  phases:
    # Phase 1: Warm up (30 seconds, 10 users/sec)
    - duration: 30
      arrivalRate: 10
      name: "Warm Up"

    # Phase 2: Ramp up to simulate flash sale start (60 seconds)
    - duration: 60
      arrivalRate: 10
      rampTo: 100
      name: "Traffic Spike"

    # Phase 3: Peak load (120 seconds, 100 users/sec)  
    - duration: 120
      arrivalRate: 100
      name: "Flash Sale Peak"

    # Phase 4: Cool down (60 seconds)
    - duration: 60
      arrivalRate: 100
      rampTo: 5
      name: "Traffic Dying Down"

scenarios:
  - name: "Browse and shop"
    flow:
      # GET health check
      - get:
          url: "/api/health"

      # GET products list
      - get:
          url: "/api/products?page=1&limit=12"

      # GET single product
      - get:
          url: "/api/products/1"

      # GET active flash sale
      - get:
          url: "/api/flash-sales/active"

      # Pause to simulate real user behavior
      - think: 1